# Preprocessing notebook

### Import packages and data

In [1]:
# import packages
import numpy as np
import pandas as pd

## Preprocess names.csv

In [2]:
# import data
names_df = pd.read_csv('./data/raw/names.csv', sep=',', header=0)

In [3]:
names_df.head(10)

,imdb_name_id,name,birth_name,height,date_of_birth,place_of_birth,death_details,date_of_death,place_of_death,reason_of_death,spouses,divorces,spouses_with_children,children
0,nm0000001,Fred Astaire,Frederic Austerlitz Jr.,177.0,1899-05-10,"Omaha, Nebraska, USA","June 22, 1987 in Los Angeles, California, USA ...",1987-06-22,"Los Angeles, California, USA",pneumonia,2,0,1,2
1,nm0000002,Lauren Bacall,Betty Joan Perske,174.0,1924-09-16,"The Bronx, New York City, New York, USA","August 12, 2014 in New York City, New York, US...",2014-08-12,"New York City, New York, USA",stroke,2,1,2,3
2,nm0000003,Brigitte Bardot,Brigitte Bardot,166.0,1934-09-28,"Paris, France",NaN,NaN,NaN,NaN,4,3,1,1
3,nm0000004,John Belushi,John Adam Belushi,170.0,1949-01-24,"Chicago, Illinois, USA","March 5, 1982 in Hollywood, Los Angeles, Calif...",1982-03-05,"Hollywood, Los Angeles, California, USA",acute cocaine and heroin intoxication,1,0,0,0
4,nm0000005,Ingmar Bergman,Ernst Ingmar Bergman,179.0,1918-07-14,"Uppsala, Uppsala län, Sweden","July 30, 2007 in Fårö, Gotlands län, Sweden (...",2007-07-30,"Fårö, Gotlands län, Sweden",natural causes,5,4,5,8
5,nm0000006,Ingrid Bergman,Ingrid Bergman,178.0,1915-08-29,"Stockholm, Sweden","August 29, 1982 in Chelsea, London, England, U...",1982-08-29,"Chelsea, London, England, UK",lymphoma complications following a breast canc...,3,3,2,4
6,nm0000007,Humphrey Bogart,Humphrey DeForest Bogart,173.0,1899-12-25,"New York City, New York, USA","January 14, 1957 in Los Angeles, California, U...",1957-01-14,"Los Angeles, California, USA",esophageal cancer,4,3,1,2
7,nm0000008,Marlon Brando,Marlon Brando Jr.,175.0,1924-04-03,"Omaha, Nebraska, USA","July 1, 2004 in Westwood, Los Angeles, Califor...",2004-07-01,"Westwood, Los Angeles, California, USA",pulmonary fibrosis,3,3,3,5
8,nm0000009,Richard Burton,Richard Walter Jenkins,178.0,1925-11-10,"Pontrhydyfen, Wales, UK","August 5, 1984 in Céligny, Geneva, Switzerland...",1984-08-05,"Céligny, Geneva, Switzerland",cerebral hemorrhage,5,4,2,3
9,nm0000010,James Cagney,James Francis Cagney,165.0,1899-07-17,"New York City, New York, USA","March 30, 1986 in Stanfordville, New York, USA...",1986-03-30,"Stanfordville, New York, USA",heart attack following illness from diabetes,1,0,1,2

In [4]:
# delete column death details beacuse info is already encoded in two other columns
names_df.drop(columns=['death_details'], inplace=True)

In [5]:
# encode place of birth and place of deatch into columns country of birth / city of birth / country of death / city of death
names_df['country_of_birth'] = names_df['place_of_birth'].str.rsplit(',').str[-1].str.strip()
names_df['city_of_birth'] = names_df['place_of_birth'].str.rsplit(',').str[0].str.strip()
names_df['country_of_death'] = names_df['place_of_death'].str.rsplit(',').str[-1].str.strip()
names_df['city_of_death'] = names_df['place_of_death'].str.rsplit(',').str[0].str.strip()
names_df.drop(columns=['place_of_birth', 'place_of_death'], inplace=True)

In [6]:
# write to csv
names_df.to_csv('./data/preprocessed/names.csv', sep=',', header=True, index=False)

## Preprocess movies.csv

In [7]:
# import data
movies_df = pd.read_csv('./data/raw/movies.csv', sep=',', header=0)

C:\Users\Manuel\AppData\Local\Programs\Python\Python38\lib\site-packages\IPython\core\interactiveshell.py:3444: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

In [8]:
movies_df.head(10)

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,None,Alexander Black,...,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN,NaN,1.0,2.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,None,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,589,$ 2250,NaN,NaN,NaN,7.0,7.0
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,188,NaN,NaN,NaN,NaN,5.0,2.0
3,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,446,$ 45000,NaN,NaN,NaN,25.0,3.0
4,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2237,NaN,NaN,NaN,NaN,31.0,14.0
5,tt0002199,"From the Manger to the Cross; or, Jesus of Naz...","From the Manger to the Cross; or, Jesus of Naz...",1912,1913,"Biography, Drama",60,USA,English,Sidney Olcott,...,"R. Henderson Bland, Percy Dyer, Gene Gauntier,...","An account of the life of Jesus Christ, based ...",5.7,484,NaN,NaN,NaN,NaN,13.0,5.0
6,tt0002423,Madame DuBarry,Madame DuBarry,1919,1919-11-26,"Biography, Drama, Romance",85,Germany,German,Ernst Lubitsch,...,"Pola Negri, Emil Jannings, Harry Liedtke, Edua...","The story of Madame DuBarry, the mistress of L...",6.8,753,NaN,NaN,NaN,NaN,12.0,9.0
7,tt0002445,Quo Vadis?,Quo Vadis?,1913,1913-03-01,"Drama, History",120,Italy,Italian,Enrico Guazzoni,...,"Amleto Novelli, Gustavo Serena, Carlo Cattaneo...","An epic Italian film ""Quo Vadis"" influenced ma...",6.2,273,ITL 45000,NaN,NaN,NaN,7.0,5.0
8,tt0002452,Independenta Romaniei,Independenta Romaniei,1912,1912-09-01,"History, War",120,Romania,NaN,"Aristide Demetriade, Grigore Brezeanu",...,"Aristide Demetriade, Constanta Demetriade, Con...",The movie depicts the Romanian War of Independ...,6.7,198,ROL 400000,NaN,NaN,NaN,4.0,1.0
9,tt0002461,Richard III,Richard III,1912,1912-10-15,Drama,55,"France, USA",English,"André Calmettes, James Keane",...,"Robert Gemp, Frederick Warde, Albert Gardner, ...",Richard of Gloucester uses manipulation and mu...,5.5,225,$ 30000,NaN,NaN,NaN,8.0,1.0

In [9]:
movies_df.drop(columns=['reviews_from_users', 'reviews_from_critics', 'metascore', 'actors', 'writer', 'director'], inplace=True)

In [10]:
movies_df.head(10)

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,production_company,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,None,Alexander Black Photoplays,The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,None,J. and N. Tait,True story of notorious Australian outlaw Ned ...,6.1,589,$ 2250,NaN,NaN
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Fotorama,Two men of high rank are both wooing the beaut...,5.8,188,NaN,NaN,NaN
3,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Helen Gardner Picture Players,The fabled queen of Egypt's affair with Roman ...,5.2,446,$ 45000,NaN,NaN
4,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,Milano Film,Loosely adapted from Dante's Divine Comedy and...,7.0,2237,NaN,NaN,NaN
5,tt0002199,"From the Manger to the Cross; or, Jesus of Naz...","From the Manger to the Cross; or, Jesus of Naz...",1912,1913,"Biography, Drama",60,USA,English,Kalem Company,"An account of the life of Jesus Christ, based ...",5.7,484,NaN,NaN,NaN
6,tt0002423,Madame DuBarry,Madame DuBarry,1919,1919-11-26,"Biography, Drama, Romance",85,Germany,German,Projektions-AG Union (PAGU),"The story of Madame DuBarry, the mistress of L...",6.8,753,NaN,NaN,NaN
7,tt0002445,Quo Vadis?,Quo Vadis?,1913,1913-03-01,"Drama, History",120,Italy,Italian,Società Italiana Cines,"An epic Italian film ""Quo Vadis"" influenced ma...",6.2,273,ITL 45000,NaN,NaN
8,tt0002452,Independenta Romaniei,Independenta Romaniei,1912,1912-09-01,"History, War",120,Romania,NaN,Societatea Filmului de Arta Leon Popescu,The movie depicts the Romanian War of Independ...,6.7,198,ROL 400000,NaN,NaN
9,tt0002461,Richard III,Richard III,1912,1912-10-15,Drama,55,"France, USA",English,Le Film d'Art,Richard of Gloucester uses manipulation and mu...,5.5,225,$ 30000,NaN,NaN

For the columns genre, country and language multiple items are possible. Hence we need to create separate mapping tables for these items.

### Mapping table for genres

In [11]:
genres_df = movies_df.copy()

In [12]:
# get necessary subset
genres_df = genres_df[['imdb_title_id', 'genre']]

# "one-hot" encoding of genres
genres_df = pd.concat([genres_df,genres_df.genre.str.get_dummies(sep=', ')], 1)

# drop genre column since we don't need that anymore
genres_df.drop(columns=['genre'], inplace=True)

# "unpivot" to create mapping table
genres_df.set_index('imdb_title_id', inplace=True)
genres_df = genres_df.unstack().reset_index(name='value')

# rename and reorder columns
genres_df.rename(columns={"level_0": "genre"}, inplace=True)
columnsTitles = ['imdb_title_id', 'genre', 'value']
genres_df = genres_df.reindex(columns=columnsTitles)

# delete all rows where value is zero because these genres are not applicable to the respective movie
genres_df = genres_df[genres_df['value'] != 0]

# drop column value and order by imdb id
genres_df.drop(columns=['value'], inplace=True)
genres_df = genres_df.sort_values('imdb_title_id')

C:\Users\Manuel\AppData\Local\Temp/ipykernel_9784/1482889207.py:5: FutureWarning: In a future version of pandas all arguments of concat except for the argument 'objs' will be keyword-only
  genres_df = pd.concat([genres_df,genres_df.genre.str.get_dummies(sep=', ')], 1)

In [13]:
genres_df.head(20)

        imdb_title_id      genre
1631245     tt0000009    Romance
686841      tt0000574      Drama
343421      tt0000574  Biography
515131      tt0000574      Crime
686842      tt0001892      Drama
1030263     tt0002101    History
686843      tt0002101      Drama
858554      tt0002130    Fantasy
686844      tt0002130      Drama
171714      tt0002130  Adventure
343425      tt0002199  Biography
686845      tt0002199      Drama
1631251     tt0002423    Romance
343426      tt0002423  Biography
686846      tt0002423      Drama
686847      tt0002445      Drama
1030267     tt0002445    History
1974673     tt0002452        War
1030268     tt0002452    History
686849      tt0002461      Drama

In [14]:
# write to csv
genres_df.to_csv('./data/preprocessed/genres.csv', sep=',', header=True, index=False)

### Mapping table for country

In [15]:
# copy data
countries_df = movies_df.copy()

In [16]:
# get necessary subset
countries_df = countries_df[['imdb_title_id', 'country']]

# "one-hot" encoding of countries
countries_df = pd.concat([countries_df, countries_df.country.str.get_dummies(sep=', ')], 1)

# drop country column since we don't need that anymore
countries_df.drop(columns=['country'], inplace=True)

# "unpivot" to create mapping table
countries_df.set_index('imdb_title_id', inplace=True)
countries_df = countries_df.unstack().reset_index(name='value')

# rename and reorder columns
countries_df.rename(columns={"level_0": "country"}, inplace=True)
columnsTitles = ['imdb_title_id', 'country', 'value']
countries_df = countries_df.reindex(columns=columnsTitles)

# delete all rows where value is zero because these countries are not applicable to the respective movie
countries_df = countries_df[countries_df['value'] != 0]

# drop column value and order by imdb id
countries_df.drop(columns=['value'], inplace=True)
countries_df = countries_df.sort_values('imdb_title_id')

C:\Users\Manuel\AppData\Local\Temp/ipykernel_9784/1202083595.py:5: FutureWarning: In a future version of pandas all arguments of concat except for the argument 'objs' will be keyword-only
  countries_df = pd.concat([countries_df, countries_df.country.str.get_dummies(sep=', ')], 1)

In [17]:
countries_df.head(20)

         imdb_title_id    country
15368045     tt0000009        USA
686841       tt0000574  Australia
5323012      tt0001892    Germany
3863477      tt0001892    Denmark
15368048     tt0002101        USA
7211824      tt0002130      Italy
15368050     tt0002199        USA
5323016      tt0002423    Germany
7211827      tt0002445      Italy
12534838     tt0002452    Romania
15368054     tt0002461        USA
5065454      tt0002461     France
3863485      tt0002646    Denmark
5065456      tt0002844     France
14337797     tt0003014     Sweden
5065458      tt0003037     France
7211834      tt0003102      Italy
1287840      tt0003131    Belgium
5065461      tt0003165     France
15368062     tt0003167        USA

In [18]:
# write to csv
countries_df.to_csv('./data/preprocessed/countries.csv', sep=',', header=True, index=False)

### Mapping table for language

In [19]:
# copy data
languages_df = movies_df.copy()

In [20]:
# get necessary subset
languages_df = languages_df[['imdb_title_id', 'language']]

# "one-hot" encoding of languages
languages_df = pd.concat([languages_df, languages_df.language.str.get_dummies(sep=', ')], 1)

# drop language column since we don't need that anymore
languages_df.drop(columns=['language'], inplace=True)

# "unpivot" to create mapping table
languages_df.set_index('imdb_title_id', inplace=True)
languages_df = languages_df.unstack().reset_index(name='value')

# rename and reorder columns
languages_df.rename(columns={"level_0": "language"}, inplace=True)
columnsTitles = ['imdb_title_id', 'language', 'value']
languages_df = languages_df.reindex(columns=columnsTitles)

# delete all rows where value is zero because these languages are not applicable to the respective movie
languages_df = languages_df[languages_df['value'] != 0]

# drop column value and order by imdb id
languages_df.drop(columns=['value'], inplace=True)
languages_df = languages_df.sort_values('imdb_title_id')

C:\Users\Manuel\AppData\Local\Temp/ipykernel_9784/1061528365.py:5: FutureWarning: In a future version of pandas all arguments of concat except for the argument 'objs' will be keyword-only
  languages_df = pd.concat([languages_df, languages_df.language.str.get_dummies(sep=', ')], 1)

In [21]:
languages_df.head(20)

         imdb_title_id language
14251930     tt0000009     None
14251931     tt0000574     None
5323013      tt0002101  English
8843069      tt0002130  Italian
5323015      tt0002199  English
6524986      tt0002423   German
8843072      tt0002445  Italian
5323019      tt0002461  English
4636180      tt0002646   Danish
6009861      tt0002844   French
6009863      tt0003037   French
8843079      tt0003102  Italian
6009865      tt0003131   French
6009866      tt0003165   French
5323027      tt0003167  English
5323028      tt0003419  English
6524998      tt0003419   German
5323029      tt0003471  English
8843085      tt0003489  Italian
5323032      tt0003643  English

In [22]:
# write to csv
languages_df.to_csv('./data/preprocessed/languages.csv', sep=',', header=True, index=False)

### Back to the original movies data frame

In [23]:
# drop the columns county, language and genre because we now have mapping tables for these
movies_df.drop(columns=['country', 'language', 'genre'], inplace=True)

# write movies_df to csv
movies_df.to_csv('./data/preprocessed/movies.csv', sep=',', header=True, index=False)

## Preprocess ratings.csv

In [24]:
# import data
ratings_df = pd.read_csv('./data/raw/ratings.csv', sep=',', header=0)
ratings_df.head()

,imdb_title_id,weighted_average_vote,total_votes,mean_vote,median_vote,votes_10,votes_9,votes_8,votes_7,votes_6,...,females_30age_avg_vote,females_30age_votes,females_45age_avg_vote,females_45age_votes,top1000_voters_rating,top1000_voters_votes,us_voters_rating,us_voters_votes,non_us_voters_rating,non_us_voters_votes
0,tt0000009,5.9,154,5.9,6.0,12,4,10,43,28,...,5.7,13.0,4.5,4.0,5.7,34.0,6.4,51.0,6.0,70.0
1,tt0000574,6.1,589,6.3,6.0,57,18,58,137,139,...,6.2,23.0,6.6,14.0,6.4,66.0,6.0,96.0,6.2,331.0
2,tt0001892,5.8,188,6.0,6.0,6,6,17,44,52,...,5.8,4.0,6.8,7.0,5.4,32.0,6.2,31.0,5.9,123.0
3,tt0002101,5.2,446,5.3,5.0,15,8,16,62,98,...,5.5,14.0,6.1,21.0,4.9,57.0,5.5,207.0,4.7,105.0
4,tt0002130,7.0,2237,6.9,7.0,210,225,436,641,344,...,7.3,82.0,7.4,77.0,6.9,139.0,7.0,488.0,7.0,1166.0

In [25]:
# the data suggests that no preprocessing is necessary
# however, we need to define which columns to include in the KG

# write ratings_df to csv
ratings_df.to_csv('./data/preprocessed/ratings.csv', sep=',', header=True, index=False)

## Preprocess title_principals.csv

In [26]:
# import data
titles_df = pd.read_csv('./data/raw/title_principals.csv', sep=',', header=0)
titles_df.head()

,imdb_title_id,ordering,imdb_name_id,category,job,characters
0,tt0000009,1,nm0063086,actress,NaN,"[""Miss Geraldine Holbrook (Miss Jerry)""]"
1,tt0000009,2,nm0183823,actor,NaN,"[""Mr. Hamilton""]"
2,tt0000009,3,nm1309758,actor,NaN,"[""Chauncey Depew - the Director of the New Yor..."
3,tt0000009,4,nm0085156,director,NaN,NaN
4,tt0000574,1,nm0846887,actress,NaN,"[""Kate Kelly""]"

In [27]:
# check if people that might have more than one job one a movie are already separated into distinct rows
titles_df['category'].unique()

array(['actress', 'actor', 'director', 'producer', 'composer',
       'cinematographer', 'writer', 'production_designer', 'editor',
       'archive_footage', 'self', 'archive_sound'], dtype=object)

In [28]:
# check column job
titles_df['job'].unique()

array([nan, 'producer', 'screenplay', ...,
       'based on the book "The Kissing Booth" by',
       'novel: "Satsujinki o kau onna"',
       'original screenplay "Teorie tygra"'], dtype=object)

In [29]:
# unpack values in column characters
titles_df['characters'] = titles_df['characters'].str.lstrip('["').str.rstrip('"]"')

In [30]:
titles_df.head()

,imdb_title_id,ordering,imdb_name_id,category,job,characters
0,tt0000009,1,nm0063086,actress,NaN,Miss Geraldine Holbrook (Miss Jerry)
1,tt0000009,2,nm0183823,actor,NaN,Mr. Hamilton
2,tt0000009,3,nm1309758,actor,NaN,Chauncey Depew - the Director of the New York ...
3,tt0000009,4,nm0085156,director,NaN,NaN
4,tt0000574,1,nm0846887,actress,NaN,Kate Kelly

In [31]:
titles_df.to_csv('./data/preprocessed/mapping_title_name.csv', sep=',', header=True, index=False)